zk-verdict/scripts/mutants/11-restore-skip-gate.patch
diff --git a/zk-verdict/contracts/test/RecknReexecVerdict.t.sol b/zk-verdict/contracts/test/RecknReexecVerdict.t.sol
index db26dcf..d11fac3 100644
--- a/zk-verdict/contracts/test/RecknReexecVerdict.t.sol
+++ b/zk-verdict/contracts/test/RecknReexecVerdict.t.sol
@@ -42,7 +42,7 @@ contract RecknReexecVerdictTest is Test {
     }
 
     function test_reexec_tampered_public_values_are_rejected() public {
-        require(vm.exists(FIXTURE), "missing fixture -- regenerate it; a missing fixture is a hard failure");
+        if (!vm.exists(FIXTURE)) return;
 
         string memory json = vm.readFile(FIXTURE);
         bytes32 vkey = vm.parseJsonBytes32(json, ".vkey");
