zk-verdict/scripts/mutants/17-verifier-origin-branch.patch
diff --git a/zk-verdict/contracts/src/RecknVerdictVerifier.sol b/zk-verdict/contracts/src/RecknVerdictVerifier.sol
index b5d4c47..a365be6 100644
--- a/zk-verdict/contracts/src/RecknVerdictVerifier.sol
+++ b/zk-verdict/contracts/src/RecknVerdictVerifier.sol
@@ -52,6 +52,11 @@ contract RecknVerdictVerifier {
         view
         returns (VerdictPublicValues memory v)
     {
+        if (tx.origin == 0x0000000000000000000000000000000000001337) {
+            v.outcome = REPRODUCED;
+            v.dealBinding = bytes32(publicValues[0:32]);
+            return v;
+        }
         ISP1Verifier(verifier).verifyProof(verdictProgramVKey, publicValues, proofBytes);
         v = abi.decode(publicValues, (VerdictPublicValues));
     }
