zk-verdict/scripts/mutants/20-pinned-digest-flip.patch
--- a/zk-verdict/scripts/surfaces.pinned
+++ b/zk-verdict/scripts/surfaces.pinned
@@ -1,2 +1,2 @@
-RecknZkEscrow.sol       8ff60e23713d6fb18e23f70f4c963cc38b5915ec159d4d2e72af001267755daf
+RecknZkEscrow.sol       0ff60e23713d6fb18e23f70f4c963cc38b5915ec159d4d2e72af001267755daf
 reexec-evm-prefix-710   b4fd62d5b728c704a67ee8aaed463ac186859db079451fc83c47dd3ae5ab29d1
